
## Plan Result




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 1 to add, 0 to change, 1 to destroy.</code></pre>

* Replace
  * azurerm_key_vault_secret.s2s-secret


<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_key_vault_secret.s2s-secret must be replaced
-/+ resource "azurerm_key_vault_secret" "s2s-secret" {
      ~ id                      = "https://sptribs-aat.vault.azure.net/secrets/s2s-secret/a503ed44f2884ac2af7d419c277fe3ca" -> (known after apply)
      ~ name                    = "s2s-secret" -> "s2s-secret-sptribs-frontend" # forces replacement
      ~ resource_id             = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/sptribs-aat/providers/Microsoft.KeyVault/vaults/sptribs-aat/secrets/s2s-secret/versions/a503ed44f2884ac2af7d419c277fe3ca" -> (known after apply)
      ~ resource_versionless_id = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/sptribs-aat/providers/Microsoft.KeyVault/vaults/sptribs-aat/secrets/s2s-secret" -> (known after apply)
        tags                    = {
            "BuiltFrom"           = "https://github.com/HMCTS/sptribs-frontend.git"
            "application"         = "special-tribunals"
            "businessArea"        = "CFT"
            "changeUrl"           = ""
            "contactSlackChannel" = "#special-tribunals-dev-channel"
            "environment"         = "staging"
            "managedBy"           = "Special Tribunals"
            "source"              = "vault s2s-aat"
        }
      ~ version                 = "a503ed44f2884ac2af7d419c277fe3ca" -> (known after apply)
      ~ versionless_id          = "https://sptribs-aat.vault.azure.net/secrets/s2s-secret" -> (known after apply)
        # (3 unchanged attributes hidden)
    }

Plan: 1 to add, 0 to change, 1 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":315,"Program":"tfcmt","SHA1":"","Vars":{}} -->